jelson/rulos/src/lib/chip/arm/stm32/core/dma.c
  if (found_idx < 0) {
    return NULL;
  }

  init_channel(found_idx, config);

  // Priority 1 is the same priority RULOS already used for its DMA IRQs
  // (see the old uart.c init path). SysTick runs at the lowest priority
  // (15), so DMA ISRs can safely call schedule_now() via the RULOS
  // scheduler's ISR-safe path.
  HAL_NVIC_SetPriority(g_hw[found_idx].irqn, 1, 0);
  HAL_NVIC_EnableIRQ(g_hw[found_idx].irqn);

  return (rulos_dma_channel_t *)&g_state[found_idx];
}

void rulos_dma_reconfigure(rulos_dma_channel_t *ch,
                           const rulos_dma_config_t *new_config) {
  init_channel(state_to_idx(ch), new_config);
}

void rulos_dma_start(rulos_dma_channel_t *ch, volatile void *periph_addr,
                     void *mem_addr, uint32_t nitems) {
  const dma_channel_hw_t *hw = &g_hw[state_to_idx(ch)];

  LL_DMA_DisableChannel(hw->dma, hw->ll_channel);
  LL_DMA_SetDataLength(hw->dma, hw->ll_channel, nitems);

  // Direction was already written to CCR by init_channel; we only pick
  // src/dst address ordering here based on what LL_DMA_ConfigAddresses
  // expects for the current direction.
  const uint32_t ccr_dir =
      LL_DMA_GetDataTransferDirection(hw->dma, hw->ll_channel);
  if (ccr_dir == LL_DMA_DIRECTION_MEMORY_TO_PERIPH) {
    LL_DMA_ConfigAddresses(hw->dma, hw->ll_channel, (uint32_t)mem_addr,
                           (uint32_t)periph_addr, ccr_dir);
  } else {
    LL_DMA_ConfigAddresses(hw->dma, hw->ll_channel, (uint32_t)periph_addr,
                           (uint32_t)mem_addr, ccr_dir);
  }

  LL_DMA_EnableChannel(hw->dma, hw->ll_channel);
}

void rulos_dma_stop(rulos_dma_channel_t *ch) {
  const dma_channel_hw_t *hw = &g_hw[state_to_idx(ch)];
  LL_DMA_DisableChannel(hw->dma, hw->ll_channel);

  // Clear any TC/HT/TE flags left over from the transfer we just
  // halted. Without this, a transfer that completes in hardware
  // right before we disable the channel leaves the IFCR flag set
  // and the NVIC line pending; the dispatcher would then fire a
  // spurious callback as soon as interrupts are next enabled (even
  // if the next action is another rulos_dma_start on the same
  // channel -- start doesn't re-run init_channel, so the flags
  // would survive across the restart). The channel is already
  // disabled above, so no new flag can be set between here and
  // return.
  ll_dma_clear_flag_tc(hw->dma, hw->ll_channel);
  ll_dma_clear_flag_ht(hw->dma, hw->ll_channel);
  ll_dma_clear_flag_te(hw->dma, hw->ll_channel);
}

uint32_t rulos_dma_get_remaining(const rulos_dma_channel_t *ch) {
  const dma_channel_hw_t *hw = &g_hw[state_to_idx(ch)];
  return LL_DMA_GetDataLength(hw->dma, hw->ll_channel);
}

void rulos_dma_free(rulos_dma_channel_t *ch) {
  const int idx = state_to_idx(ch);
  const dma_channel_hw_t *hw = &g_hw[idx];
  LL_DMA_DisableChannel(hw->dma, hw->ll_channel);

  // Silence this channel at the DMA-hardware level by disabling its
  // TC/HT/TE interrupt enables, rather than disabling the NVIC line.
  // On merged-IRQ families (G0/F0) the NVIC line is shared with up
  // to 9 other DMA channels, so HAL_NVIC_DisableIRQ(hw->irqn) would
  // knock out every other allocated channel on the same line.
  LL_DMA_DisableIT_TC(hw->dma, hw->ll_channel);
  LL_DMA_DisableIT_HT(hw->dma, hw->ll_channel);
  LL_DMA_DisableIT_TE(hw->dma, hw->ll_channel);

  rulos_irq_state_t irq = hal_start_atomic();
  g_state[idx] = (dma_channel_state_t){0};
  hal_end_atomic(irq);
}

// ----------------------------------------------------------------------------
// IRQ dispatch
// ----------------------------------------------------------------------------

CCMRAM static void dispatch_channel_irq(int idx) {
  const dma_channel_hw_t *hw = &g_hw[idx];
  dma_channel_state_t *s = &g_state[idx];
  if (hw->dma == NULL || !s->allocated) {
    return;
  }

  if (ll_dma_is_active_flag_tc(hw->dma, hw->ll_channel)) {
    ll_dma_clear_flag_tc(hw->dma, hw->ll_channel);
    if (s->tc_callback) {
      s->tc_callback(s->user_data);
    }
  }

  if (ll_dma_is_active_flag_ht(hw->dma, hw->ll_channel)) {
    ll_dma_clear_flag_ht(hw->dma, hw->ll_channel);
    if (s->ht_callback) {
      s->ht_callback(s->user_data);
    }
  }

  if (ll_dma_is_active_flag_te(hw->dma, hw->ll_channel)) {
    ll_dma_clear_flag_te(hw->dma, hw->ll_channel);
    if (s->error_callback) {
      s->error_callback(s->user_data);
    }
  }
}

/*
 * Per-chip IRQ handlers. Each handler dispatches to one or more
 * channel slots in g_state[]/g_hw[]. On G4 every DMA channel has its
 * own dedicated IRQ, so handlers are one-to-one. On G0 many channels
 * share an IRQ line and the shared handler loops over every slot in
 * its group, calling dispatch_channel_irq() on each. The dispatcher
 * early-exits on channels that didn't fire, so calling it on idle
 * channels is essentially free (one load + one early return).
 */

#if defined(RULOS_ARM_stm32g4) || defined(RULOS_ARM_stm32f1) || \
    defined(RULOS_ARM_stm32f3)

#ifdef DMA1_Channel1_BASE
CCMRAM void DMA1_Channel1_IRQHandler(void) {
  dispatch_channel_irq(0);
}
#endif
#ifdef DMA1_Channel2_BASE
CCMRAM void DMA1_Channel2_IRQHandler(void) {
  dispatch_channel_irq(1);
}
#endif
#ifdef DMA1_Channel3_BASE
CCMRAM void DMA1_Channel3_IRQHandler(void) {
  dispatch_channel_irq(2);
}
#endif
#ifdef DMA1_Channel4_BASE
CCMRAM void DMA1_Channel4_IRQHandler(void) {
  dispatch_channel_irq(3);
}
#endif
#ifdef DMA1_Channel5_BASE
CCMRAM void DMA1_Channel5_IRQHandler(void) {
  dispatch_channel_irq(4);
}
#endif
#ifdef DMA1_Channel6_BASE
CCMRAM void DMA1_Channel6_IRQHandler(void) {
  dispatch_channel_irq(5);
}
#endif
#ifdef DMA1_Channel7_BASE
CCMRAM void DMA1_Channel7_IRQHandler(void) {
  dispatch_channel_irq(6);
}
#endif
#ifdef DMA1_Channel8_BASE
CCMRAM void DMA1_Channel8_IRQHandler(void) {
  dispatch_channel_irq(7);
}
#endif
#ifdef DMA2_Channel1_BASE
CCMRAM void DMA2_Channel1_IRQHandler(void) {
  dispatch_channel_irq(8);
}
#endif
#ifdef DMA2_Channel2_BASE
CCMRAM void DMA2_Channel2_IRQHandler(void) {
  dispatch_channel_irq(9);
}
#endif
#ifdef DMA2_Channel3_BASE
CCMRAM void DMA2_Channel3_IRQHandler(void) {
  dispatch_channel_irq(10);
}
#endif
#ifdef DMA2_Channel4_BASE
CCMRAM void DMA2_Channel4_IRQHandler(void) {
  dispatch_channel_irq(11);
}
#endif
#ifdef DMA2_Channel5_BASE
CCMRAM void DMA2_Channel5_IRQHandler(void) {
  dispatch_channel_irq(12);
}
#endif
#ifdef DMA2_Channel6_BASE
CCMRAM void DMA2_Channel6_IRQHandler(void) {
  dispatch_channel_irq(13);
}
#endif
#ifdef DMA2_Channel7_BASE
CCMRAM void DMA2_Channel7_IRQHandler(void) {
  dispatch_channel_irq(14);
}
#endif
#ifdef DMA2_Channel8_BASE
CCMRAM void DMA2_Channel8_IRQHandler(void) {
  dispatch_channel_irq(15);
}
#endif

#elif defined(RULOS_ARM_stm32g0)

// DMA1 Channel 1 has its own dedicated interrupt.
void DMA1_Channel1_IRQHandler(void) {
  dispatch_channel_irq(0);
}

